Revit 2024 API
ViewSchedule.CreateSchedule Method (Document, ElementId)
 Creates a regular schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ViewSchedule CreateSchedule(
	Document document,
	ElementId categoryId
)
Visual Basic
Public Shared Function CreateSchedule ( _
	document As Document, _
	categoryId As ElementId _
) As ViewSchedule
Visual C++
public:
static ViewSchedule^ CreateSchedule(
	Document^ document,
	ElementId^ categoryId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the new schedule will be added.
categoryId
Type: Autodesk.Revit.DB.ElementId
 The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Return Value
 The newly created schedule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- categoryId is not a valid category for a regular schedule. -or- The Areas category was specified but an area scheme ID was not provided.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ViewSchedule Class
CreateSchedule Overload
Autodesk.Revit.DB Namespace